I'm gonna make up some practice data and try to make an astrology chart out of it.

In [1]:
import pandas as pd
import numpy as np
import flatlib as fl
import geopy as gp
import re

In [6]:
df = pd.DataFrame([['Daiana', 'September 16, 1997; 9:00', 'Berlin, Germany'],['Jackson', 'July 2, 1997; 16:07', 'London, England; GB'],['Samantha', 'October 26, 1997; 14:00', 'Salem, Oregon; USA']], columns = ['name', 'birthtime', 'birthplace'])

In [7]:
df.head()

       name                 birthtime           birthplace
0    Daiana  September 16, 1997; 9:00      Berlin, Germany
1   Jackson       July 2, 1997; 16:07  London, England; GB
2  Samantha   October 26, 1997; 14:00   Salem, Oregon; USA

Now I need to come up with a method which transforms birthtime into the proper format and a birthplace into a long/lat.

In [9]:
## The birthtime thing should be pretty easy I think. I won't do it all out, but the following example is helpful.
#date = Datetime('2015/03/13', '17:00', '+00:00')
## To get birthplace into lon/lat, use geopy.
#location = geolocator.geocode("175 5th Avenue NYC")

from geopy.geocoders import Nominatim
geolocator = Nominatim(user_agent="specify_your_app_name_here")

from geopy.extra.rate_limiter import RateLimiter
geocode = RateLimiter(geolocator.geocode, min_delay_seconds=1)
df['location'] = df['birthplace'].apply(geocode)
df['point'] = df['location'].apply(lambda loc: tuple(loc.point) if loc else None)

In [10]:
df.head()

,name,birthtime,birthplace,location,point
0,Daiana,"September 16, 1997; 9:00","Berlin, Germany","(Berlin, Deutschland, (52.5170365, 13.3888599))","(52.5170365, 13.3888599, 0.0)"
1,Jackson,"July 2, 1997; 16:07","London, England; GB","(London, Greater London, England, SW1A 2DX, Un...","(51.5073219, -0.1276474, 0.0)"
2,Samantha,"October 26, 1997; 14:00","Salem, Oregon; USA","(Salem, Marion County, Oregon, United States o...","(44.9391565, -123.033121, 0.0)"

It works!!! That means I can put the lon/lat directly into my pandas dataframe.

My question now is how to extract a birthdate and birthtime from jumbly data.

E.g.:

In [ ]:
'''
Steve Cozzi - Birth Chart

Gender:Male

Date of Birth:16 September 1945 - 02:44h

Birth place:Chicago, Illinois

Country:United States US, United States

Age:74 years

Sun:  Vir

Moon: Cap

ASC:   Leo

Life Path: 8

Compatibility

Occupation:astrologer
'''
#We need to use regex here.
#We're looking for something that looks like...
## [1 or 2 numbers] + [space] + [January or February or ... or December] + [space] + [4 numbers] + [space] + [any character] + [space] + [two numbers] + [colon] + two numbers.
# ^We want to store this value in our dataframe as 'birthtime' (or 'birthtime_clean' or something).

birthtime_patter = [0-9]+' *'+[]...

In [11]:
#Wait... there's a better way to do this.
import time

In [22]:
time.strptime('December 29, 2005 Thursday', "%B %d, %Y %A")
#time.strptime('December 29, 2005 Thursday', "%B %d, %Y %A").tm_year
#time.strptime('December 29, 2005 Thursday', "%B %d, %Y %A").tm_mon
#time.strptime('December 29, 2005 Thursday', "%B %d, %Y %A").tm_day
#time.strptime('December 29, 2005 Thursday', "%B %d, %Y %A").tm_hour
#time.strptime('December 29, 2005 Thursday', "%B %d, %Y %A").tm_min

time.struct_time(tm_year=2005, tm_mon=12, tm_mday=29, tm_hour=0, tm_min=0, tm_sec=0, tm_wday=3, tm_yday=363, tm_isdst=-1)

In [31]:
#time.strptime('December 29, 2005 Thursday', "%B %d, %Y %A")
time.strptime('16 September 1945 - 02:44h', "%d %B %Y - %H:%Mh")

time.struct_time(tm_year=1945, tm_mon=9, tm_mday=16, tm_hour=2, tm_min=44, tm_sec=0, tm_wday=6, tm_yday=259, tm_isdst=-1)

In [41]:
jarbled_up_txt1 = '''
Steve Cozzi - Birth Chart

Gender:Male

Date of Birth:16 September 1945 - 02:44h

Birth place:Chicago, Illinois

Country:United States US, United States

Age:74 years

Sun:  Vir

Moon: Cap

ASC:   Leo

Life Path: 8

Compatibility

Occupation:astrologer
'''
jarbled_up_txt2 = '''
Frank Black - Birth Chart
(Charles Michael Kittredge Thompson IV)
Gender:Male
Date of Birth:6 April 1965 - 10:29h
Birth place:Boston
Country:United States US, United States
Age:55 years
Sun:  Ari
Moon: Gem
ASC:   Can
Life Path: 4
Compatibility
Occupation:composer, guitarist, singer
'''
jarbled_up_strng = jarbled_up_txt1.replace('\n', '')
count = 0
while count < len(jarbled_up_strng):
    try:
        #t = time.strptime('16 September 1945 - 02:44h', "%d %B %Y - %H:%Mh")
        partial_text = jarbled_up_strng[count:]
        colon_idx = partial_text.index(':')
        new_partial_text = partial_text[:colon_idx + 4]
        #print(new_partial_text)
        t = time.strptime(new_partial_text, "%d %B %Y - %H:%Mh")
        print(t)
        break
    except:
        count += 1

time.struct_time(tm_year=1945, tm_mon=9, tm_mday=16, tm_hour=2, tm_min=44, tm_sec=0, tm_wday=6, tm_yday=259, tm_isdst=-1)